In [2]:
import pandas as pd

data = {'Nama': ['John', 'Jane', 'Bob', 'Alice'],
        'Usia': [25, 35, 30, 28],
        'Gaji': [50000, 60000, 70000, 55000]}

df = pd.DataFrame(data)
df

    Nama  Usia   Gaji
0   John    25  50000
1   Jane    35  60000
2    Bob    30  70000
3  Alice    28  55000

Gunakan loop for dan fungsi lambda untuk menghitung gaji setiap karyawan setelah diberikan peningkatan sebesar 5% dari gaji saat ini.

In [14]:
hasil_tamp=[]
for i in data['Gaji']:
    naik_gaji = lambda i: i + (0.05) * i
    i=naik_gaji(i)
    hasil_tamp.append(i)

data_jumlah= {'Nama': ['John', 'Jane', 'Bob', 'Alice'],
            'Gajih_baru' :hasil_tamp} 
df_baru= pd.DataFrame(data_jumlah)
jumlah= df_baru['Gajih_baru'].sum()

data_jumlah= {'Usia': [25, 35, 30, 28],
            'Nama': ['John', 'Jane', 'Bob', 'Alice'],
            'Gajih_baru' :hasil_tamp,
            'Total_Gaji': [jumlah,jumlah,jumlah,jumlah]}
data_jumlah =pd.DataFrame(data_jumlah)
data_jumlah

   Usia   Nama  Gajih_baru  Total_Gaji
0    25   John     52500.0    246750.0
1    35   Jane     63000.0    246750.0
2    30    Bob     73500.0    246750.0
3    28  Alice     57750.0    246750.0

Gunakan loop for lagi untuk mengevaluasi karyawan yang usianya di atas 30 tahun. Jika usia karyawan di atas 30, berikan peningkatan tambahan sebesar 2% dari gaji saat ini menggunakan fungsi lambda.

In [38]:
data_tambah=[]
for u in zip(data_jumlah['Usia'],data_jumlah['Gajih_baru']): 
    if u[0]>30:
        tambahan = lambda u: u[1] + (0.02) * u[1]
        hasil_tambahan = tambahan(u)
        
    else:
        hasil_tambahan = "TETAP"
    
    data_tambah.append(hasil_tambahan)
    
data_jumlah_tambah= {'Usia': [25, 35, 30, 28],
            'Nama': ['John', 'Jane', 'Bob', 'Alice'],
            'Gajih_baru' :hasil_tamp,
            'Total_gaji_usia' :data_tambah}
            
data_jumlah_tambah= pd.DataFrame(data_jumlah_tambah)
data_jumlah_tambah

   Usia   Nama  Gajih_baru Total_gaji_usia
0    25   John     52500.0           TETAP
1    35   Jane     63000.0         64260.0
2    30    Bob     73500.0           TETAP
3    28  Alice     57750.0           TETAP